Tekla Open API Reference for Tekla Structures 2025
Boolean Structure
 The Boolean datatype.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
[TypeConverterAttribute(typeof(BooleanConverter))]
public struct Boolean : IXmlSerializable, IDataType
<SerializableAttribute>
<TypeConverterAttribute(GetType(BooleanConverter))>
Public Structure Boolean
	Implements IXmlSerializable, IDataType
The Boolean type exposes the following members.
Constructors
Name | Description
Boolean
 Initializes a new instance of the structure.
Top
Properties
Name | Description
Value
 Gets or sets the boolean value.
Top
Remarks
 The purpose of this type is to enable dialog field binding with StructuresExtender. You don't need to use this type in your own programs.
See Also
Reference
Tekla.Structures.Datatype Namespace